t21/Walnut_X/Packages/.cache/Keil.STM32F7xx_DFP.2.7.0.pdsc
      <sequences>

        <!-- Override for Pre-Defined DebugCoreStart Sequence -->
        <sequence name="DebugCoreStart">
          <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR

            // Device Specific Debug Setup
            Write32(0xE0042004, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0xE0042008, DbgMCU_APB1_Fz);                                    // DBGMCU_APB1_FZ: Configure APB1 Peripheral Freeze Behavior
            Write32(0xE004200C, DbgMCU_APB2_Fz);                                    // DBGMCU_APB1_FZ: Configure APB2 Peripheral Freeze Behavior
          </block>
        </sequence>

        <!-- Override for Pre-Defined TraceStart Sequence -->
        <sequence name="TraceStart">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                        // SWO Trace Selected?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                        // TPIU Trace Selected?
          </block>

          <control if="traceSWO">
            <block>
              Sequence("EnableTraceSWO");                                           // Call SWO Trace Setup
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");                                          // Call TPIU Trace Setup
            </block>
          </control>

        </sequence>

        <!-- User-Defined EnableTraceSWO Sequence -->
        <sequence name="EnableTraceSWO">
          <block>
            __var dbgmcu_val       = 0;                                             // DBGMCU_CR Value
            __var dbgmcu_trace_val = 0;                                             // DBGMCU_CR Value

            dbgmcu_val        = Read32(0xE0042004) &amp; (~0xE0);                   // Read DBGMCU_CR and clear trace setup
            dbgmcu_trace_val  = (1 &lt;&lt; 5);                                     // Trace I/O Enable + Trace Mode Asynchronous
          </block>

            <!-- configure SWO -->
              <block info="configure SWO (PB3)">
                Write32(0x40023830, ( Read32(0x40023830)                    | 0x00000002) );  // RCC_AHB1ENR: IO port B clock enable
                Write32(0x40020400, ((Read32(0x40020400) &amp; ~0x000000C0) | 0x00000080) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40020408, ((Read32(0x40020408)                  ) | 0x000000C0) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002040C, ((Read32(0x4002040C) &amp; ~0x000000C0)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40020420, ((Read32(0x40020420) &amp; ~0x0000F000)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>

          <block info="configure Trace I/O Enable + Trace Mode Asynchronous">
            Write32(0xE0042004, dbgmcu_val | dbgmcu_trace_val);                               // Write DBGMCU_CR: Trace Settings
          </block>
        </sequence>

        <!-- User-Defined EnableTraceTPIU Sequence -->
        <sequence name="EnableTraceTPIU">
          <block>
            __var width            = (__traceout &amp; 0x003F0000) &gt;&gt; 16;
            __var dbgmcu_val       = 0;                                             // DBGMCU_CR Value
            __var dbgmcu_trace_val = 0;                                             // DBGMCU_CR Value

            dbgmcu_val        = Read32(0xE0042004) &amp; (~0xE0);                   // Read DBGMCU_CR and clear trace setup
          </block>

            <!-- configure TRACECLK -->
              <block info="configure TRACECLK (PE2)">
                Write32(0x40023830, ( Read32(0x40023830)                    | 0x00000010) );  // RCC_AHB1ENR: IO port E clock enable
                Write32(0x40021000, ((Read32(0x40021000) &amp; ~0x00000030) | 0x00000020) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40021008, ((Read32(0x40021008)                  ) | 0x00000030) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002100C, ((Read32(0x4002100C) &amp; ~0x00000030)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40021020, ((Read32(0x40021020) &amp; ~0x00000F00)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>

          <control if="width &gt;= 1" info="TPIU port width 1">
            <!-- configure TRACED0 -->
            <control if="ETMTrace_D0 == 0" info="TRACED0 = PC1?">
              <block info="configure TRACED0 (PC1)">
                Write32(0x40023830,  (Read32(0x40023830)                    | 0x00000004) );  // RCC_AHB1ENR: IO port C clock enable
                Write32(0x40020800, ((Read32(0x40020800) &amp; ~0x0000000C) | 0x00000008) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40020808, ((Read32(0x40020808)                  ) | 0x0000000C) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002080C, ((Read32(0x4002080C) &amp; ~0x0000000C)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40020820, ((Read32(0x40020820) &amp; ~0x000000F0)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="ETMTrace_D0 == 1" info="TRACED0 = PE3?">
              <block info="configure TRACED0 (PE3)">
                // Write32(0x40023830,  (Read32(0x40023830)                    | 0x00000010) );  // RCC_AHB1ENR: IO port E clock enable
                Write32(0x40021000, ((Read32(0x40021000) &amp; ~0x000000C0) | 0x00000080) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40021008, ((Read32(0x40021008)                  ) | 0x000000C0) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002100C, ((Read32(0x4002100C) &amp; ~0x000000C0)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40021020, ((Read32(0x40021020) &amp; ~0x0000F000)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="ETMTrace_D0 == 2" info="TRACED0 = PG13?">
              <block info="configure TRACED0 (PG13)">
                Write32(0x40023830,  (Read32(0x40023830)                    | 0x00000040) );  // RCC_AHB1ENR: IO port G clock enable
                Write32(0x40021800, ((Read32(0x40021800) &amp; ~0x0C000000) | 0x08000000) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40021808, ((Read32(0x40021808)                  ) | 0x0C000000) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002180C, ((Read32(0x4002180C) &amp; ~0x0C000000)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40021824, ((Read32(0x40021824) &amp; ~0x00F00000)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="ETMTrace_D0 &gt; 2" info="TRACED0 not configured">
              <block>
                Query(0, "TRACED0 not configured. Using Pin PE3.", 1);

                Write32(0x40021000, ((Read32(0x40021000) &amp; ~0x000000C0) | 0x00000080) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40021008, ((Read32(0x40021008)                  ) | 0x000000C0) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002100C, ((Read32(0x4002100C) &amp; ~0x000000C0)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40021020, ((Read32(0x40021020) &amp; ~0x0000F000)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>

