t21/Walnut_X/Packages/.cache/Keil.STM32F7xx_DFP.2.7.0.pdsc
            <block info="configure Trace I/O Enable + Trace Mode Synchronous 1 bit">
              dbgmcu_trace_val  = (3 &lt;&lt; 5);
            </block>
          </control>

          <control if="width &gt;= 2" info="TPIU port width 2">
            <!-- configure TRACED1 -->
            <control if="ETMTrace_D1 == 0" info="TRACED1 = PC8?">
              <block info="configure TRACED1 (PC8)">
                Write32(0x40023830,  (Read32(0x40023830)                    | 0x00000004) );  // RCC_AHB1ENR: IO port C clock enable
                Write32(0x40020800, ((Read32(0x40020800) &amp; ~0x00030000) | 0x00020000) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40020808, ((Read32(0x40020808)                  ) | 0x00030000) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002080C, ((Read32(0x4002080C) &amp; ~0x00030000)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40020824, ((Read32(0x40020824) &amp; ~0x0000000F)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="ETMTrace_D1 == 1" info="TRACED1 = PE4?">
              <block info="configure TRACED1 (PE4)">
                // Write32(0x40023830,  (Read32(0x40023830)                    | 0x00000010) );  // RCC_AHB1ENR: IO port E clock enable
                Write32(0x40021000, ((Read32(0x40021000) &amp; ~0x00000300) | 0x00000200) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40021008, ((Read32(0x40021008)                  ) | 0x00000300) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002100C, ((Read32(0x4002100C) &amp; ~0x00000300)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40021020, ((Read32(0x40021020) &amp; ~0x000F0000)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="ETMTrace_D1 == 2" info="TRACED1 = PG14?">
              <block info="configure TRACED1 (PG14)">
                Write32(0x40023830,  (Read32(0x40023830)                    | 0x00000040) );  // RCC_AHB1ENR: IO port G clock enable
                Write32(0x40021800, ((Read32(0x40021800) &amp; ~0x30000000) | 0x20000000) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40021808, ((Read32(0x40021808)                  ) | 0x30000000) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002180C, ((Read32(0x4002180C) &amp; ~0x30000000)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40021824, ((Read32(0x40021824) &amp; ~0x0F000000)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="ETMTrace_D1 &gt; 2" info="TRACED1 not configured">
              <block>
                Query(0, "TRACED1 not configured. Using Pin PE4.", 1);

                Write32(0x40021000, ((Read32(0x40021000) &amp; ~0x00000300) | 0x00000200) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40021008, ((Read32(0x40021008)                  ) | 0x00000300) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002100C, ((Read32(0x4002100C) &amp; ~0x00000300)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40021020, ((Read32(0x40021020) &amp; ~0x000F0000)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>

            <block info="configure Trace I/O Enable + Trace Mode Synchronous 2 bit">
              dbgmcu_trace_val  = (5 &lt;&lt; 5);
            </block>
          </control>

          <control if="width &gt;= 4" info="TPIU port width 4">
            <!-- configure TRACED2 -->
            <control if="ETMTrace_D2 == 0" info="TRACED2 = PD2?">
              <block info="configure TRACED2 (PD2)">
                Write32(0x40023830,  (Read32(0x40023830)                    | 0x00000008) );  // RCC_AHB1ENR: IO port D clock enable
                Write32(0x40020C00, ((Read32(0x40020C00) &amp; ~0x00000030) | 0x00000020) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40020C08, ((Read32(0x40020C08)                  ) | 0x00000030) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x40020C0C, ((Read32(0x40020C0C) &amp; ~0x00000030)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40020C20, ((Read32(0x40020C20) &amp; ~0x00000F00)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="ETMTrace_D2 == 1" info="TRACED2 = PE5?">
              <block info="configure TRACED2 (PE5)">
                // Write32(0x40023830,  (Read32(0x40023830)                    | 0x00000010) );  // RCC_AHB1ENR: IO port E clock enable
                Write32(0x40021000, ((Read32(0x40021000) &amp; ~0x00000C00) | 0x00000800) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40021008, ((Read32(0x40021008)                  ) | 0x00000C00) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002100C, ((Read32(0x4002100C) &amp; ~0x00000C00)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40021020, ((Read32(0x40021020) &amp; ~0x00F00000)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="ETMTrace_D2 &gt; 1" info="TRACED2 not configured">
              <block>
                Query(0, "TRACED2 not configured. Using Pin PE5.", 1);

                Write32(0x40021000, ((Read32(0x40021000) &amp; ~0x00000C00) | 0x00000800) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40021008, ((Read32(0x40021008)                  ) | 0x00000C00) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002100C, ((Read32(0x4002100C) &amp; ~0x00000C00)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40021020, ((Read32(0x40021020) &amp; ~0x00F00000)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>

            <!-- configure TRACED3 -->
            <control if="ETMTrace_D3 == 0" info="TRACED3 = PC12?">
              <block info="configure TRACED3 (PC12)">
                Write32(0x40023830,  (Read32(0x40023830)                    | 0x00000004) );  // RCC_AHB1ENR: IO port C clock enable
                Write32(0x40020800, ((Read32(0x40020800) &amp; ~0x03000000) | 0x02000000) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40020808, ((Read32(0x40020808)                  ) | 0x03000000) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002080C, ((Read32(0x4002080C) &amp; ~0x03000000)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40020824, ((Read32(0x40020824) &amp; ~0x000F0000)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="ETMTrace_D3 == 1" info="TRACED3 = PE6?">
              <block info="configure TRACED3 (PE6)">
                // Write32(0x40023830,  (Read32(0x40023830)                    | 0x00000010) );  // RCC_AHB1ENR: IO port E clock enable
                Write32(0x40021000, ((Read32(0x40021000) &amp; ~0x00003000) | 0x00002000) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40021008, ((Read32(0x40021008)                  ) | 0x00003000) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002100C, ((Read32(0x4002100C) &amp; ~0x00003000)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40021020, ((Read32(0x40021020) &amp; ~0x0F000000)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>
            <control if="ETMTrace_D3 &gt; 1" info="TRACED3 not configured">
              <block>
                Query(0, "TRACED3 not configured. Using Pin PE6.", 1);

                Write32(0x40021000, ((Read32(0x40021000) &amp; ~0x00003000) | 0x00002000) );  // GPIOx_MODER:   Set Mode (Alternate Function)
                Write32(0x40021008, ((Read32(0x40021008)                  ) | 0x00003000) );  // GPIOx_OSPEEDR: Set Speed (Very High Speed)
                Write32(0x4002100C, ((Read32(0x4002100C) &amp; ~0x00003000)             ) );  // GPIOx_PUPDR:   Set I/O to no pull-up/pull-down
                Write32(0x40021020, ((Read32(0x40021020) &amp; ~0x0F000000)             ) );  // GPIOx_AFRL:    Alternate Function to AF0
              </block>
            </control>

            <block info="configure Trace I/O Enable + Trace Mode Synchronous 4 bit">
              dbgmcu_trace_val  = (7 &lt;&lt; 5);
            </block>
          </control>

          <block info="configure Trace I/O Enable + Trace Mode Asynchronous">
            Write32(0xE0042004, dbgmcu_val | dbgmcu_trace_val);                               // Write DBGMCU_CR: Trace Settings
          </block>
        </sequence>

