t21/Walnut_X/Packages/.cache/Keil.STM32F7xx_DFP.2.7.0.pdsc
        <!-- *************************  Device 'STM32F765VI'  ***************************** -->
        <device Dname="STM32F765VI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F765VITx"> <feature type="QFP" n="100"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765ZG'  ***************************** -->
        <device Dname="STM32F765ZG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F765ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F765ZI'  ***************************** -->
        <device Dname="STM32F765ZI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F765ZITx"> <feature type="QFP" n="144"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F767'  **************************** -->
      <subFamily DsubFamily="STM32F767">
        <processor Dfpu="DP_FPU"/>
        <debug svd="CMSIS/SVD/STM32F7x7.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F7xx/Include/stm32f7xx.h" define="STM32F767xx"/>
        <memory id="IRAM1" start="0x20020000" size="0x60000"   init="0" default="1" />
        <memory id="IRAM2" start="0x20000000" size="0x20000"   init="0" default="1" />
        <book name="Documentation/DM00224583.pdf" title="STM32F76xxx/7xxx Reference Manual"/>
        <book name="Documentation/DM00273119.pdf" title="STM32F765/767/768A/769 Data Sheet"/>

        <!-- *************************  Device 'STM32F767BI'  ***************************** -->
        <device Dname="STM32F767BI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F767BITx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F767BG'  ***************************** -->
        <device Dname="STM32F767BG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F767BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F767NI'  ***************************** -->
        <device Dname="STM32F767NI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F767NIHx"> <feature type="BGA" n="216"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F767NG'  ***************************** -->
        <device Dname="STM32F767NG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F767NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>
          <!-- *************************  Device 'STM32F767II'  ***************************** -->
        <device Dname="STM32F767II">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F767IITx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F767IIKx"> <feature type="BGA" n="176"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F767IG'  ***************************** -->
        <device Dname="STM32F767IG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F767IGTx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32F767IGKx"> <feature type="BGA" n="176"/> </variant>
        </device>
         <!-- *************************  Device 'STM32F767ZI'  ***************************** -->
        <device Dname="STM32F767ZI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F767ZITx"> <feature type="QFP" n="144"/> </variant>
        </device>
        <!-- *************************  Device 'STM32F767ZG'  ***************************** -->
        <device Dname="STM32F767ZG">
          <memory id="IROM1" start="0x08000000" size="0x100000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x100000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_1024.FLM"        start="0x08000000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_TCM.FLM"         start="0x00200000" size="0x100000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F767ZGTx"> <feature type="QFP" n="144"/> </variant>
        </device>
         <!-- *************************  Device 'STM32F767VI'  ***************************** -->
        <device Dname="STM32F767VI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F767VITx"> <feature type="QFP" n="100"/> </variant>
        </device>
