t21/Walnut_X/Packages/.cache/Keil.STM32F7xx_DFP.2.7.0.pdsc
        <!-- *************************  Device 'STM32F779AI'  ***************************** -->
        <device Dname="STM32F779AI">
          <memory id="IROM1" start="0x08000000" size="0x200000" startup="1" default="1" />
          <memory id="IROM2" start="0x00200000" size="0x200000" startup="0" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048.FLM"        start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7x_2048dual.FLM"    start="0x08000000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048.FLM"     start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="1" />
          <algorithm name="CMSIS/Flash/STM32F7xTCM_2048dual.FLM" start="0x00200000" size="0x200000" RAMstart="0x20020000" RAMsize="0x1000" default="0" />
          <variant Dvariant="STM32F779AIYx"> <feature type="CSP" n="180"/> </variant>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <condition id="CM7_LE_ARMCC">
      <description>Cortex-M7 processor based device in little endian mode for the ARM Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM7F_LE_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the ARM Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="CM7_LE_GCC">
      <description>Cortex-M7 processor based device in little endian mode for the GCC Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7F_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="CM7_LE_IAR">
      <description>Cortex-M7 processor based device in little endian mode for the IAR Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7F_LE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>

    <condition id="STM32F7">
      <description>STMicroelectronics STM32F7 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F7*"/>
    </condition>

    <condition id="STM32F745">
      <description>STMicroelectronics STM32F745 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F745*"/>
    </condition>
    <condition id="STM32F746">
      <description>STMicroelectronics STM32F746 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F746*"/>
    </condition>
    <condition id="STM32F756">
      <description>STMicroelectronics STM32F756 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F756*"/>
    </condition>
    <condition id="STM32F765">
      <description>STMicroelectronics STM32F765 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F765*"/>
    </condition>
    <condition id="STM32F767">
      <description>STMicroelectronics STM32F767 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F767*"/>
    </condition>
    <condition id="STM32F768">
      <description>STMicroelectronics STM32F768 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F768*"/>
    </condition>
    <condition id="STM32F769">
      <description>STMicroelectronics STM32F769 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F769*"/>
    </condition>
    <condition id="STM32F777">
      <description>STMicroelectronics STM32F777 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F777*"/>
    </condition>
    <condition id="STM32F778">
      <description>STMicroelectronics STM32F778 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F778*"/>
    </condition>
    <condition id="STM32F779">
      <description>STMicroelectronics STM32F779 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F779*"/>
    </condition>

    <condition id="STM32F7x6">
      <description>STMicroelectronics STM32F746/756 Series devices</description>
      <accept  condition="STM32F746"/>
      <accept  condition="STM32F756"/>
    </condition>
    <condition id="STM32F7x6_7x7_7x8_7x9">
      <description>STMicroelectronics STM32F746/756/767/768/769/777/778/779 Series devices</description>
      <accept  condition="STM32F746"/>
      <accept  condition="STM32F756"/>
      <accept  condition="STM32F767"/>
      <accept  condition="STM32F768"/>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F777"/>
      <accept  condition="STM32F778"/>
      <accept  condition="STM32F779"/>
    </condition>
    <condition id="STM32F76x_77x">
      <description>STMicroelectronics STM32F765/767/768/769/777/778/779 Series devices</description>
      <accept  condition="STM32F765"/>
      <accept  condition="STM32F767"/>
      <accept  condition="STM32F768"/>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F777"/>
      <accept  condition="STM32F778"/>
      <accept  condition="STM32F779"/>
    </condition>
    <condition id="STM32F7x9">
      <description>STMicroelectronics STM32F769/779 Series devices</description>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F779"/>
    </condition>
    <condition id="STM32F7x7_7x8_7x9">
      <description>STMicroelectronics STM32F767/768/769/777/778/779 Series devices</description>
      <accept  condition="STM32F767"/>
      <accept  condition="STM32F768"/>
      <accept  condition="STM32F769"/>
      <accept  condition="STM32F777"/>
      <accept  condition="STM32F778"/>
      <accept  condition="STM32F779"/>
    </condition>

    <condition id="STM32F7_ARMCC">
      <description>filter for STM32F7xx devices and the ARM compiler</description>
      <require condition="STM32F7"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32F745_ARMCC">
      <description>filter for STM32F745 devices and the ARM compiler</description>
      <require condition="STM32F745"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32F746_ARMCC">
      <description>filter for STM32F745 devices and the ARM compiler</description>
      <require condition="STM32F746"/>
      <require Tcompiler="ARMCC"/>
    </condition>
