t21/Walnut_X/Packages/.cache/Keil.STM32F7xx_DFP.2.7.0.pdsc
    <condition id="STM32F7 CMSIS_Driver USB">
      <description>Requirement for CMSIS USB Driver</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="CMSIS"  Cgroup="RTOS"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>

    <condition id="STM32F7 CMSIS SAI and I2C Driver">
      <description>STM32F7 CMSIS SAI and I2C</description>
      <require condition="STM32F7"/>
      <require Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.0"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2"/>
    </condition>

    <condition id="STM32F746G-Discovery LCD_RGB">
      <description>STMicroelectronics STM32F746G-Discovery LCD (RGB IF)</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Graphics Display" Cgroup="STM32F746G-Discovery" Cvariant="RGB IF"/>
    </condition>
    <condition id="STM32F746G-Discovery GLCD">
      <description>STMicroelectronics STM32F746G-Discovery GLCD</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
    </condition>
    <condition id="STM32F746G-Discovery TS">
      <description>STMicroelectronics STM32F746G-Discovery TS</description>
      <require condition="STM32F7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Touch Screen"/>
    </condition>

    <condition id="STM32F746G-Discovery BSP">
      <description>STMicroelectronics STM32F746G-Discovery BSP</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP Audio">
      <description>STMicroelectronics STM32F746G-Discovery BSP Audio</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SAI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP Camera">
      <description>STMicroelectronics STM32F746G-Discovery BSP Camera</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DCMI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP EEPROM">
      <description>STMicroelectronics STM32F746G-Discovery BSP EEPROM</description>
      <require condition="STM32F7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP LCD">
      <description>STMicroelectronics STM32F746G-Discovery BSP LCD</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP QSPI">
      <description>STMicroelectronics STM32F746G-Discovery BSP QSPI</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="QSPI"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP SD">
      <description>STMicroelectronics STM32F746G-Discovery BSP SD</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP SDRAM">
      <description>STMicroelectronics STM32F746G-Discovery BSP SDRAM</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SDRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F746G-Discovery BSP TS">
      <description>STMicroelectronics STM32F746G-Discovery BSP TS</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>

    <condition id="STM32756G-EVAL LCD_RGB">
      <description>STMicroelectronics STM32756G-EVAL LCD (RGB IF)</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Graphics Display" Cgroup="STM32756G-EVAL" Cvariant="RGB IF"/>
    </condition>
    <condition id="STM32756G-EVAL GLCD">
      <description>STMicroelectronics STM32756G-EVAL GLCD</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
    </condition>
    <condition id="STM32756G-EVAL TS">
      <description>STMicroelectronics STM32746G-EVAL TS</description>
      <require condition="STM32F7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Touch Screen"/>
    </condition>
    <condition id="STM32756G-EVAL Joystick">
      <description>STMicroelectronics STM32746G-EVAL Joystick</description>
      <require condition="STM32F7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>

    <condition id="STM32756G-EVAL BSP">
      <description>STMicroelectronics STM32746G-EVAL BSP</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"/>
    </condition>
    <condition id="STM32756G-EVAL BSP Audio">
      <description>STMicroelectronics STM32756G-EVAL BSP Audio</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SAI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2S"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32756G-EVAL BSP Camera">
      <description>STMicroelectronics STM32756G-EVAL BSP Camera</description>
      <require condition="STM32F7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DCMI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32756G-EVAL BSP EEPROM">
      <description>STMicroelectronics STM32756G-EVAL BSP EEPROM</description>
      <require condition="STM32F7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
