t21/Walnut_X/Packages/.cache/Keil.STM32F7xx_DFP.2.7.0.pdsc
    <example name="emWin Example" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/emWin/Example">
      <description>emWin Graphics simple example</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="emWin GUI Demo" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/emWin/GUIDemo">
      <description>emWin Graphics Demo example</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="emWin VNC Server with STM32CubeMX" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/CubeMX/emWin/GUI_VNC">
      <description>emWin VNC Server example configured with STM32CubeMX</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="GUI_VNC.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="USB Device Audio" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/USB/Device/Audio">
      <description>USB Audio Device demonstrating USB Headphone</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Audio.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="Audio"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Audio</keyword>
      </attributes>
    </example>

    <example name="USB Device HID" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/USB/Device/HID">
      <description>USB Human Interface Device providing access from PC to board LEDs and push buttons</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="HID.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>HID</keyword>
      </attributes>
    </example>

    <example name="USB Device Mass Storage" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/USB/Device/MassStorage">
      <description>USB Mass Storage Device using RAM as storage media</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Memory Disk</keyword>
      </attributes>
    </example>

    <example name="USB Device Virtual COM" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/USB/Device/VirtualCOM">
      <description>Bridge between PC USB Virtual COM Port and UART port</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="VirtualCOM.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Device" Csub="CDC"/>
        <category>Middleware</category>
        <category>USB Device</category>
        <keyword>Virtual COM</keyword>
      </attributes>
    </example>

    <example name="USB Host Mass Storage" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/USB/Host/MassStorage">
      <description>USB Host file manipulation example: create, read, copy, delete files from USB Mass Storage Device and format the storage device</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="MassStorage.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="MSC"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Mass Storage</keyword>
      </attributes>
    </example>

    <example name="USB Host Keyboard" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/USB/Host/Keyboard">
      <description>Measure example using USB HID Keyboard as input device</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Keyboard.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="USB" Cgroup="Host" Csub="HID"/>
        <category>Middleware</category>
        <category>USB Host</category>
        <keyword>Keyboard</keyword>
      </attributes>
    </example>

    <example name="File System Demo" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/FileSystem/File_Demo">
      <description>File manipulation example: create, read, copy, delete files on any enabled drive (SD/MMC Card, NOR/NAND Flash, RAM) and format each drive</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="File_Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="File System" Cgroup="Drive"/>
        <category>Middleware</category>
        <category>File System</category>
        <keyword>SD/MMC Card</keyword>
      </attributes>
    </example>

    <example name="BSD Client" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/Network/BSD_Client">
      <description>Example using BSD sockets to send commands to remote server</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="BSD_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="BSD Client IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/NetworkDS/BSD_Client">
      <description>Example using BSD sockets to send commands to remote server</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="BSD_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="BSD Server" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/Network/BSD_Server">
      <description>Example using BSD sockets to accept commands from remote clients</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="BSD_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="BSD Server IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/NetworkDS/BSD_Server">
      <description>Example using BSD sockets to accept commands from remote clients</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="BSD_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="FTP Server" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/Network/FTP_Server">
      <description>File Server using FTP protocol with SD/MMC Memory Card as storage media</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="FTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="FTP Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>FTP</keyword>
      </attributes>
    </example>

    <example name="FTP Server IPv4/IPv6" doc="Abstract.txt" folder="MDK/Boards/ST/STM32F746G_Discovery/Middleware/NetworkDS/FTP_Server">
      <description>File Server using FTP protocol with SD/MMC Memory Card as storage media</description>
      <board name="STM32F746G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="FTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="FTP Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>FTP</keyword>
      </attributes>
    </example>

